###################################################################

# Created by write_sdc on Thu Dec 7 14:22:44 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_transition 0.15 [current_design]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports clk]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports rst]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {mode_in[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {mode_in[0]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports change_mode]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[37]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[36]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[35]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[34]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[33]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[32]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[31]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[30]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[29]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[28]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[27]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[26]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[25]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[24]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[23]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[22]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[21]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[20]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[19]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[18]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[17]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[16]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[15]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[14]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[13]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[12]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[11]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[10]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[9]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[8]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[7]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[6]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[5]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[4]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[3]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[2]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {ifmap_packet[0]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[37]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[36]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[35]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[34]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[33]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[32]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[31]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[30]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[29]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[28]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[27]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[26]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[25]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[24]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[23]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[22]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[21]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[20]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[19]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[18]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[17]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[16]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[15]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[14]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[13]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[12]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[11]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[10]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[9]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[8]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[7]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[6]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[5]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[4]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[3]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[2]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {filter_packet[0]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {op_stage_in[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {op_stage_in[0]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {psum_in[14]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {psum_in[13]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {psum_in[12]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {psum_in[11]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {psum_in[10]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {psum_in[9]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {psum_in[8]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {psum_in[7]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {psum_in[6]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {psum_in[5]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {psum_in[4]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {psum_in[3]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {psum_in[2]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {psum_in[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {psum_in[0]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports psum_ack_in]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports conv_continue]
set_load -pin_load 0.3 [get_ports {psum_out[14]}]
set_load -pin_load 0.3 [get_ports {psum_out[13]}]
set_load -pin_load 0.3 [get_ports {psum_out[12]}]
set_load -pin_load 0.3 [get_ports {psum_out[11]}]
set_load -pin_load 0.3 [get_ports {psum_out[10]}]
set_load -pin_load 0.3 [get_ports {psum_out[9]}]
set_load -pin_load 0.3 [get_ports {psum_out[8]}]
set_load -pin_load 0.3 [get_ports {psum_out[7]}]
set_load -pin_load 0.3 [get_ports {psum_out[6]}]
set_load -pin_load 0.3 [get_ports {psum_out[5]}]
set_load -pin_load 0.3 [get_ports {psum_out[4]}]
set_load -pin_load 0.3 [get_ports {psum_out[3]}]
set_load -pin_load 0.3 [get_ports {psum_out[2]}]
set_load -pin_load 0.3 [get_ports {psum_out[1]}]
set_load -pin_load 0.3 [get_ports {psum_out[0]}]
set_load -pin_load 0.3 [get_ports psum_ack_out]
set_load -pin_load 0.3 [get_ports conv_done]
set_load -pin_load 0.3 [get_ports error]
set_load -pin_load 0.3 [get_ports full]
set_max_transition 0.08 [get_ports {psum_out[14]}]
set_max_transition 0.08 [get_ports {psum_out[13]}]
set_max_transition 0.08 [get_ports {psum_out[12]}]
set_max_transition 0.08 [get_ports {psum_out[11]}]
set_max_transition 0.08 [get_ports {psum_out[10]}]
set_max_transition 0.08 [get_ports {psum_out[9]}]
set_max_transition 0.08 [get_ports {psum_out[8]}]
set_max_transition 0.08 [get_ports {psum_out[7]}]
set_max_transition 0.08 [get_ports {psum_out[6]}]
set_max_transition 0.08 [get_ports {psum_out[5]}]
set_max_transition 0.08 [get_ports {psum_out[4]}]
set_max_transition 0.08 [get_ports {psum_out[3]}]
set_max_transition 0.08 [get_ports {psum_out[2]}]
set_max_transition 0.08 [get_ports {psum_out[1]}]
set_max_transition 0.08 [get_ports {psum_out[0]}]
set_max_transition 0.08 [get_ports psum_ack_out]
set_max_transition 0.08 [get_ports conv_done]
set_max_transition 0.08 [get_ports error]
set_max_transition 0.08 [get_ports full]
create_clock [get_ports clk]  -name core_clk  -period 5  -waveform {0 2.5}
set_clock_latency 0.2  [get_clocks core_clk]
set_clock_uncertainty 0.5  [get_clocks core_clk]
set_clock_transition -min -fall 0.08 [get_clocks core_clk]
set_clock_transition -min -rise 0.08 [get_clocks core_clk]
set_clock_transition -max -fall 0.08 [get_clocks core_clk]
set_clock_transition -max -rise 0.08 [get_clocks core_clk]
group_path -name FEEDTHROUGH  -from [list [get_ports rst] [get_ports {mode_in[1]}] [get_ports {mode_in[0]}] [get_ports change_mode] [get_ports {ifmap_packet[37]}] [get_ports {ifmap_packet[36]}] [get_ports {ifmap_packet[35]}] [get_ports {ifmap_packet[34]}] [get_ports {ifmap_packet[33]}] [get_ports {ifmap_packet[32]}] [get_ports {ifmap_packet[31]}] [get_ports {ifmap_packet[30]}] [get_ports {ifmap_packet[29]}] [get_ports {ifmap_packet[28]}] [get_ports {ifmap_packet[27]}] [get_ports {ifmap_packet[26]}] [get_ports {ifmap_packet[25]}] [get_ports {ifmap_packet[24]}] [get_ports {ifmap_packet[23]}] [get_ports {ifmap_packet[22]}] [get_ports {ifmap_packet[21]}] [get_ports {ifmap_packet[20]}] [get_ports {ifmap_packet[19]}] [get_ports {ifmap_packet[18]}] [get_ports {ifmap_packet[17]}] [get_ports {ifmap_packet[16]}] [get_ports {ifmap_packet[15]}] [get_ports {ifmap_packet[14]}] [get_ports {ifmap_packet[13]}] [get_ports {ifmap_packet[12]}] [get_ports {ifmap_packet[11]}] [get_ports {ifmap_packet[10]}] [get_ports {ifmap_packet[9]}] [get_ports {ifmap_packet[8]}] [get_ports {ifmap_packet[7]}] [get_ports {ifmap_packet[6]}] [get_ports {ifmap_packet[5]}] [get_ports {ifmap_packet[4]}] [get_ports {ifmap_packet[3]}] [get_ports {ifmap_packet[2]}] [get_ports {ifmap_packet[1]}] [get_ports {ifmap_packet[0]}] [get_ports {filter_packet[37]}] [get_ports {filter_packet[36]}] [get_ports {filter_packet[35]}] [get_ports {filter_packet[34]}] [get_ports {filter_packet[33]}] [get_ports {filter_packet[32]}] [get_ports {filter_packet[31]}] [get_ports {filter_packet[30]}] [get_ports {filter_packet[29]}] [get_ports {filter_packet[28]}] [get_ports {filter_packet[27]}] [get_ports {filter_packet[26]}] [get_ports {filter_packet[25]}] [get_ports {filter_packet[24]}] [get_ports {filter_packet[23]}] [get_ports {filter_packet[22]}] [get_ports {filter_packet[21]}] [get_ports {filter_packet[20]}] [get_ports {filter_packet[19]}] [get_ports {filter_packet[18]}] [get_ports {filter_packet[17]}] [get_ports {filter_packet[16]}] [get_ports {filter_packet[15]}] [get_ports {filter_packet[14]}] [get_ports {filter_packet[13]}] [get_ports {filter_packet[12]}] [get_ports {filter_packet[11]}] [get_ports {filter_packet[10]}] [get_ports {filter_packet[9]}] [get_ports {filter_packet[8]}] [get_ports {filter_packet[7]}] [get_ports {filter_packet[6]}] [get_ports {filter_packet[5]}] [get_ports {filter_packet[4]}] [get_ports {filter_packet[3]}] [get_ports {filter_packet[2]}] [get_ports {filter_packet[1]}] [get_ports {filter_packet[0]}] [get_ports {op_stage_in[1]}] [get_ports {op_stage_in[0]}] [get_ports {psum_in[14]}] [get_ports {psum_in[13]}] [get_ports {psum_in[12]}] [get_ports {psum_in[11]}] [get_ports {psum_in[10]}] [get_ports {psum_in[9]}] [get_ports {psum_in[8]}] [get_ports {psum_in[7]}] [get_ports {psum_in[6]}] [get_ports {psum_in[5]}] [get_ports {psum_in[4]}] [get_ports {psum_in[3]}] [get_ports {psum_in[2]}] [get_ports {psum_in[1]}] [get_ports {psum_in[0]}] [get_ports psum_ack_in] [get_ports conv_continue]]  -to [list [get_ports {psum_out[14]}] [get_ports {psum_out[13]}] [get_ports {psum_out[12]}] [get_ports {psum_out[11]}] [get_ports {psum_out[10]}] [get_ports {psum_out[9]}] [get_ports {psum_out[8]}] [get_ports {psum_out[7]}] [get_ports {psum_out[6]}] [get_ports {psum_out[5]}] [get_ports {psum_out[4]}] [get_ports {psum_out[3]}] [get_ports {psum_out[2]}] [get_ports {psum_out[1]}] [get_ports {psum_out[0]}] [get_ports psum_ack_out] [get_ports conv_done] [get_ports error] [get_ports full]]
group_path -name REGIN  -from [get_ports rst]
group_path -name REGIN  -from [list [get_ports {mode_in[1]}] [get_ports {mode_in[0]}] [get_ports change_mode] [get_ports {ifmap_packet[37]}] [get_ports {ifmap_packet[36]}] [get_ports {ifmap_packet[35]}] [get_ports {ifmap_packet[34]}] [get_ports {ifmap_packet[33]}] [get_ports {ifmap_packet[32]}] [get_ports {ifmap_packet[31]}] [get_ports {ifmap_packet[30]}] [get_ports {ifmap_packet[29]}] [get_ports {ifmap_packet[28]}] [get_ports {ifmap_packet[27]}] [get_ports {ifmap_packet[26]}] [get_ports {ifmap_packet[25]}] [get_ports {ifmap_packet[24]}] [get_ports {ifmap_packet[23]}] [get_ports {ifmap_packet[22]}] [get_ports {ifmap_packet[21]}] [get_ports {ifmap_packet[20]}] [get_ports {ifmap_packet[19]}] [get_ports {ifmap_packet[18]}] [get_ports {ifmap_packet[17]}] [get_ports {ifmap_packet[16]}] [get_ports {ifmap_packet[15]}] [get_ports {ifmap_packet[14]}] [get_ports {ifmap_packet[13]}] [get_ports {ifmap_packet[12]}] [get_ports {ifmap_packet[11]}] [get_ports {ifmap_packet[10]}] [get_ports {ifmap_packet[9]}] [get_ports {ifmap_packet[8]}] [get_ports {ifmap_packet[7]}] [get_ports {ifmap_packet[6]}] [get_ports {ifmap_packet[5]}] [get_ports {ifmap_packet[4]}] [get_ports {ifmap_packet[3]}] [get_ports {ifmap_packet[2]}] [get_ports {ifmap_packet[1]}] [get_ports {ifmap_packet[0]}] [get_ports {filter_packet[37]}] [get_ports {filter_packet[36]}] [get_ports {filter_packet[35]}] [get_ports {filter_packet[34]}] [get_ports {filter_packet[33]}] [get_ports {filter_packet[32]}] [get_ports {filter_packet[31]}] [get_ports {filter_packet[30]}] [get_ports {filter_packet[29]}] [get_ports {filter_packet[28]}] [get_ports {filter_packet[27]}] [get_ports {filter_packet[26]}] [get_ports {filter_packet[25]}] [get_ports {filter_packet[24]}] [get_ports {filter_packet[23]}] [get_ports {filter_packet[22]}] [get_ports {filter_packet[21]}] [get_ports {filter_packet[20]}] [get_ports {filter_packet[19]}] [get_ports {filter_packet[18]}] [get_ports {filter_packet[17]}] [get_ports {filter_packet[16]}] [get_ports {filter_packet[15]}] [get_ports {filter_packet[14]}] [get_ports {filter_packet[13]}] [get_ports {filter_packet[12]}] [get_ports {filter_packet[11]}] [get_ports {filter_packet[10]}] [get_ports {filter_packet[9]}] [get_ports {filter_packet[8]}] [get_ports {filter_packet[7]}] [get_ports {filter_packet[6]}] [get_ports {filter_packet[5]}] [get_ports {filter_packet[4]}] [get_ports {filter_packet[3]}] [get_ports {filter_packet[2]}] [get_ports {filter_packet[1]}] [get_ports {filter_packet[0]}] [get_ports {op_stage_in[1]}] [get_ports {op_stage_in[0]}] [get_ports {psum_in[14]}] [get_ports {psum_in[13]}] [get_ports {psum_in[12]}] [get_ports {psum_in[11]}] [get_ports {psum_in[10]}] [get_ports {psum_in[9]}] [get_ports {psum_in[8]}] [get_ports {psum_in[7]}] [get_ports {psum_in[6]}] [get_ports {psum_in[5]}] [get_ports {psum_in[4]}] [get_ports {psum_in[3]}] [get_ports {psum_in[2]}] [get_ports {psum_in[1]}] [get_ports {psum_in[0]}] [get_ports psum_ack_in] [get_ports conv_continue]]
group_path -name REGOUT  -to [list [get_ports {psum_out[14]}] [get_ports {psum_out[13]}] [get_ports {psum_out[12]}] [get_ports {psum_out[11]}] [get_ports {psum_out[10]}] [get_ports {psum_out[9]}] [get_ports {psum_out[8]}] [get_ports {psum_out[7]}] [get_ports {psum_out[6]}] [get_ports {psum_out[5]}] [get_ports {psum_out[4]}] [get_ports {psum_out[3]}] [get_ports {psum_out[2]}] [get_ports {psum_out[1]}] [get_ports {psum_out[0]}] [get_ports psum_ack_out] [get_ports conv_done] [get_ports error] [get_ports full]]
set_false_path   -from [get_ports rst]
